apache/nuttx/arch/arm/src/stm32h7/stm32_crypto.c
/****************************************************************************
 * arch/arm/src/stm32h7/stm32_crypto.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/debug.h>
#include <sys/param.h>
#include <errno.h>
#include <stdint.h>

#include <crypto/cryptodev.h>
#include <crypto/xform.h>
#include <nuttx/crypto/crypto.h>

#include "arm_internal.h"
#include "hardware/stm32_rcc.h"
#include "hardware/stm32h7xxxx_crc.h"
#include "hardware/stm32h7xxxx_hash.h"

/* Following constants used in reverse32() to reverse
 * bit order of 32-bit value
 */
#define REV32_CONST1 0x55555555
#define REV32_CONST2 0x33333333
#define REV32_CONST3 0x0F0F0F0F
#define REV32_CONST4 0x00FF00FF

/* number polling iterations to wait for CRC to reset */

#define STM32H7_CRC_TIMEOUT 1000 /* should be enough... */

/* number polling iterations to wait for HASH to set CDIS/DINIS,
 * or to clear BUSY
 */

#define STM32H7_HASH_TIMEOUT 1000 /* should be enough... */

#define CRC32_XOR_VALUE 0xFFFFFFFFUL

/* #define CONFIG_STM32_CRYPTO_DEBUG */

#ifdef CONFIG_STM32_CRYPTO_DEBUG
#define stm32cryptoinfo(format, ...)                                      \
  do {                                                                  \
    __arch_syslog(LOG_INFO, "%s:%d " format, __FUNCTION__, __LINE__, ##__VA_ARGS__); \
  } while (0)
#define stm32cryptoinfo_at(func, line, format, ...)                      \
  do {                                                                  \
    __arch_syslog(LOG_INFO, "%s:%d " format, func, line, ##__VA_ARGS__); \
  } while (0)
#define stm32crypto_getreg32(reg) stm32_crypto_getreg32(__FUNCTION__, __LINE__, reg)
#define stm32crypto_putreg32(val, reg) stm32_crypto_putreg32(__FUNCTION__, __LINE__, val, reg)
#define stm32crypto_putreg16(val, reg) stm32_crypto_putreg16(__FUNCTION__, __LINE__, val, reg)
#define stm32crypto_putreg8(val, reg) stm32_crypto_putreg8(__FUNCTION__, __LINE__, val, reg)
#else
#define stm32cryptoinfo(format, ...)
#define stm32cryptoinfo_at(func, line, format, ...)
#define stm32crypto_getreg32(reg) getreg32(reg)
#define stm32crypto_putreg32(val, reg) putreg32(val, reg)
#define stm32crypto_putreg16(val, reg) putreg16(val, reg)
#define stm32crypto_putreg8(val, reg) putreg8(val, reg)
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static bool g_stm32_crc_initialized = false;
static bool g_stm32_hash_initialized = false;

static uint32_t g_stm32_sesnum = 0;

static FAR struct stm32_crypto_data **stm32_crypto_sessions = NULL;

struct stm32_crypto_data
{
  int hw_alg;  /* Algorithm; */
  union
    {
      struct stm32_crc32
        {
          uint32_t init;  /* init/interim CRC value */
        } crc;
      struct stm32_hash
        {
          bool hmac;      /* true if hmac */
          uint8_t *key;   /* hmac key */
          uint32_t klen;  /* hmac key length */
          uint32_t rdata; /* unaligned hash data */
          uint32_t dsize; /* # byte sin digest */
          uint32_t rlen;  /* # bytes accumulated in rdata */
        } hash;
    } u;
  struct stm32_crypto_data *hw_next;
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

bool stm32_crypto_debug_flag = true;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifdef CONFIG_STM32_CRYPTO_DEBUG
struct rn
{
  FAR const char *name;
  uint32_t regaddr;
};

static struct rn stm32_crypto_regnames [] =
{
    {
      "RCC_AHB4RSTR", STM32_RCC_AHB4RSTR,
    },

    {
      "RCC_AHB4ENR", STM32_RCC_AHB4ENR,
    },

    {
      "CRC_DR", STM32_CRC_DR,
    },

    {
      "CRC_IDR", STM32_CRC_IDR,
    },

    {
      "CRC_CR", STM32_CRC_CR,
    },

    {
      "CRC_INIT", STM32_CRC_INIT,
    },

    {
      "CRC_POL", STM32_CRC_POL,
    },

    {
      "RCC_AHB2RSTR", STM32_RCC_AHB2RSTR,
    },

    {
      "RCC_AHB2ENR", STM32_RCC_AHB2ENR,
    },

    {
      "HASH_CR", STM32_HASH_CR,
    },

    {
      "HASH_DIN", STM32_HASH_DIN,
    },

    {
      "HASH_STR", STM32_HASH_STR,
    },

    {
      "HASH_HRA0", STM32_HASH_HRA0,
    },

    {
      "HASH_HRA1", STM32_HASH_HRA1,
    },

    {
      "HASH_HRA2", STM32_HASH_HRA2,
    },

    {
      "HASH_HRA3", STM32_HASH_HRA3,
    },

    {
      "HASH_HRA4", STM32_HASH_HRA4,
    },

    {
      "HASH_HR0", STM32_HASH_HR0,
    },

    {
      "HASH_HR1", STM32_HASH_HR1,
    },

    {
      "HASH_HR2", STM32_HASH_HR2,
    },

    {
      "HASH_HR3", STM32_HASH_HR3,
    },

    {
      "HASH_HR4", STM32_HASH_HR4,
    },

    {
      "HASH_HR5", STM32_HASH_HR5,
    },

    {
      "HASH_HR6", STM32_HASH_HR6,
    },

    {
      "HASH_HR7", STM32_HASH_HR7,
    },

    {
      "HASH_IMR", STM32_HASH_IMR,
    },

    {
      "HASH_SR", STM32_HASH_SR,
    },

    {
      "HASH_CSR0", STM32_HASH_CSR0,
    },
};

const char *stm32_crypto_regname(uint32_t regaddr)
{
  int i;

