apache/nuttx/arch/arm/src/stm32h7/stm32_crypto.c
  for (i = 0; i < nitems(stm32_crypto_regnames); ++i)
    {
      if (stm32_crypto_regnames[i].regaddr == regaddr)
        {
          return stm32_crypto_regnames[i].name;
        }
    }

  return "???";
}

static uint32_t stm32_crypto_getreg32(const char *func, int line,
                                  uint32_t regaddr)
{
  const char *regname = stm32_crypto_regname(regaddr);
  char buf[128];
  uint32_t val;

  val = getreg32(regaddr);
  if (stm32_crypto_debug_flag)
    {
      snprintf(buf, sizeof(buf), "%08" PRIx32 "(%s)<=%08" PRIx32 "",
               regaddr, regname, val);
      stm32cryptoinfo_at(func, line, " %s", buf);
    }

  return val;
}

static void stm32_crypto_putreg8(const char *func, int line,
                              uint32_t val, uint32_t regaddr)
{
  const char *regname = stm32_crypto_regname(regaddr);
  char buf[128];

  if (stm32_crypto_debug_flag)
    {
      snprintf(buf, sizeof(buf), "%08" PRIx32 "(%s)=>%02" PRIx32 "",
               regaddr, regname, (val & 0xff));
      stm32cryptoinfo_at(func, line, " %s", buf);
    }

  putreg8(val & 0xff, regaddr);
}

static void stm32_crypto_putreg16(const char *func, int line,
                              uint32_t val, uint32_t regaddr)
{
  const char *regname = stm32_crypto_regname(regaddr);
  char buf[128];

  if (stm32_crypto_debug_flag)
    {
      snprintf(buf, sizeof(buf), "%08" PRIx32 "(%s)=>%04" PRIx32 "",
               regaddr, regname, (val & 0xffff));
      stm32cryptoinfo_at(func, line, " %s", buf);
    }

  putreg16(val & 0xffff, regaddr);
}

static void stm32_crypto_putreg32(const char *func, int line,
                              uint32_t val, uint32_t regaddr)
{
  const char *regname = stm32_crypto_regname(regaddr);
  char buf[128];

  if (stm32_crypto_debug_flag)
    {
      snprintf(buf, sizeof(buf), "%08" PRIx32 "(%s)=>%08" PRIx32 "",
               regaddr, regname, val);
      stm32cryptoinfo_at(func, line, " %s", buf);
    }

  putreg32(val, regaddr);
}
#endif

/****************************************************************************
 * Name: stm32_wait_for_clr
 *
 * Description:
 *   wait for all bits in bitmask to clear in HW register
 *
 ****************************************************************************/

static int stm32_wait_for_clr(uintptr_t regaddr, uint32_t bitmask,
                              uint32_t timeout)
{
  uint32_t regval;
  while (timeout--)
    {
      regval = stm32crypto_getreg32(regaddr);
      if ((regval & bitmask) == 0)
        {
          return 0;
        }
    }

  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: stm32_wait_for_set
 *
 * Description:
 *   wait for all bits in bitmask to set in HW register
 *
 ****************************************************************************/

static int stm32_wait_for_set(uintptr_t regaddr, uint32_t bitmask,
                              uint32_t timeout)
{
  uint32_t regval;
  while (timeout--)
    {
      regval = stm32crypto_getreg32(regaddr);
      if ((regval & bitmask) == bitmask)
        {
          return 0;
        }
    }

  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: reverse32
 *
 * Description:
 *   reverse bit order of 32-bit value
 *
 ****************************************************************************/

static uint32_t reverse32(uint32_t val)
{
  val = ((val >> 1) & REV32_CONST1) | ((val & REV32_CONST1) << 1);
  val = ((val >> 2) & REV32_CONST2) | ((val & REV32_CONST2) << 2);
  val = ((val >> 4) & REV32_CONST3) | ((val & REV32_CONST3) << 4);
  val = ((val >> 8) & REV32_CONST4) | ((val & REV32_CONST4) << 8);
  return (val >> 16) | (val << 16);
}

static int crc32_init(struct stm32_crypto_data *sw)
{
  irqstate_t flags;
  uint32_t regval;
  int ret;

  /* Set the initial value to start a CRC calculation */

  sw->u.crc.init = CRC32_XOR_VALUE;

  if (!g_stm32_crc_initialized)
    {
      g_stm32_crc_initialized = true;

      flags = enter_critical_section();

      /* Clear/set AHB4RSTR to reset CRC peripheral */

      regval  = stm32crypto_getreg32(STM32_RCC_AHB4RSTR);
      regval |= RCC_AHB4RSTR_CRCRST;
      stm32crypto_putreg32(regval, STM32_RCC_AHB4RSTR);
      regval &= ~RCC_AHB4RSTR_CRCRST;
      stm32crypto_putreg32(regval, STM32_RCC_AHB4RSTR);

      leave_critical_section(flags);
    }

  /* Do not set REV_OUT since that breaks being able to chain
   * buffers by simply reading CRC_DR at end of one update and
   * writing it back into CRC_INIT at start of next buffer
   */

  regval = stm32crypto_getreg32(STM32_CRC_CR);
  regval &= ~(CRC_CR_REV_OUT_MASK | CRC_CR_REV_IN_MASK
              | CRC_CR_POLYSIZE_MASK);
  regval |= CRC_CR_POLYSIZE_32BIT;

  regval |= CRC_CR_REV_IN_BYTE;
  regval |= CRC_CR_RESET;

  stm32crypto_putreg32(regval, STM32_CRC_CR);

  ret = stm32_wait_for_clr(STM32_CRC_CR, CRC_CR_RESET,
                           STM32H7_CRC_TIMEOUT);

  return ret;
}

static int crc32_update(struct stm32_crypto_data *sw,
                        uint8_t *buf, uint32_t len)
{
  const uint8_t *in_byte = buf;
  uint32_t regval;

  stm32crypto_putreg32(sw->u.crc.init, STM32_CRC_INIT);

  while (len >= sizeof(uint32_t))
    {
      regval = (in_byte[0] << 24) | (in_byte[1] << 16)
            |  (in_byte[2] << 8)  | (in_byte[3] << 0);
      stm32crypto_putreg32(regval, STM32_CRC_DR);
      in_byte += sizeof(uint32_t);
      len -= sizeof(uint32_t);
    }

  if (len)
    {
      if (len == 1)
        {
          stm32crypto_putreg8(in_byte[0], STM32_CRC_DR);
        }
      else if (len == 2)
        {
          regval = ((uint16_t)(in_byte[0]) << 8) | (uint16_t)in_byte[1];
          stm32crypto_putreg16(regval, STM32_CRC_DR);
        }
      else
        {
          regval = ((uint16_t)(in_byte[0]) << 8) | (uint16_t)in_byte[1];
          stm32crypto_putreg16(regval, STM32_CRC_DR);
          stm32crypto_putreg8(in_byte[2], STM32_CRC_DR);
        }
    }

  /* Extract current CRC and save for next iteration. */

  regval = stm32crypto_getreg32(STM32_CRC_DR);
  sw->u.crc.init = regval;

