apache/nuttx/arch/arm/src/stm32h7/stm32_crypto.c
  return 0;
}

static int crc32_final(struct stm32_crypto_data *sw, caddr_t digest)
{
  uint32_t val;

  /* CRC is saved in init value - but its reversed due to HW
   * implementation.  Reverse and invert to get true
   * CRC-32 result.
   */

  val = sw->u.crc.init;
  val = reverse32(val) ^ CRC32_XOR_VALUE;
  stm32cryptoinfo("init: %08" PRIx32 " result: %08" PRIx32 "",
                  sw->u.crc.init, val);
  memcpy(digest, &val, sizeof(uint32_t));
  return 0;
}

static int hash_init(struct stm32_crypto_data *sw)
{
  irqstate_t flags;
  uint32_t regval;

  stm32cryptoinfo("");

  if (!g_stm32_hash_initialized)
    {
      g_stm32_hash_initialized = true;

      flags = enter_critical_section();

      /* Clear/set AHB2RSTR to reset CRYP peripheral */

      regval  = stm32crypto_getreg32(STM32_RCC_AHB2RSTR);
      regval |= RCC_AHB2RSTR_HASHRST;
      stm32crypto_putreg32(regval, STM32_RCC_AHB2RSTR);
      regval &= ~RCC_AHB2RSTR_HASHRST;
      stm32crypto_putreg32(regval, STM32_RCC_AHB2RSTR);

      leave_critical_section(flags);
    }

  /* Set the algorithm and digest size */

  regval = 0;
  switch (sw->hw_alg)
    {
      case CRYPTO_SHA1:
      case CRYPTO_SHA1_HMAC:
        regval = HASH_CR_ALGO_SHA1;
        sw->u.hash.dsize = 20;
        break;
      case CRYPTO_MD5:
      case CRYPTO_MD5_HMAC:
        regval = HASH_CR_ALGO_MD5;
        sw->u.hash.dsize = 16;
        break;
      case CRYPTO_SHA2_224:
      case CRYPTO_SHA2_224_HMAC:
        regval = HASH_CR_ALGO_SHA2_224;
        sw->u.hash.dsize = 28;
      break;
      case CRYPTO_SHA2_256:
      case CRYPTO_SHA2_256_HMAC:
        regval = HASH_CR_ALGO_SHA2_256;
        sw->u.hash.dsize = 32;
        break;

      default:
        return -EINVAL;
    }

  /* If HMAC set mode, and key is large set HASH_CR_LKEY bit */

  if (sw->u.hash.hmac)
  {
    regval |= HASH_CR_MODE_HMAC;
    stm32cryptoinfo("klen %" PRIx32 "", sw->u.hash.klen);
    if (sw->u.hash.klen > 64)
    {
      regval |= HASH_CR_LKEY_GT_64;
    }
  }

  regval |= HASH_CR_INIT;       /* set init to configure HASH algorithm */
  regval |= HASH_CR_DATATYPE_8; /* 8-bit data... */
  stm32crypto_putreg32(regval, STM32_HASH_CR);

  sw->u.hash.rlen = 0;
  sw->u.hash.rdata = 0;

  return 0;
}

static int hash_update(struct stm32_crypto_data *sw,
                       uint8_t *buf, uint32_t len)
{
  const uint8_t *in_byte = buf;
  const uint32_t *in_block;
  int ret;

  stm32cryptoinfo("buf %" PRIxPTR " len %" PRIu32 "",
                  (uintptr_t)buf, len);

  if (len == 0)
    {
      return 0;
    }

  /* If any remainder leftover from previous accumulation
   * then accumulate them into hash.rdata to
   * push into DIN
   */

  if (sw->u.hash.rlen)
    {
      while (sw->u.hash.rlen < sizeof(uint32_t))
        {
          if (!len)
            {
              break;
            }

          sw->u.hash.rdata |= (in_byte[0] << (8 * sw->u.hash.rlen));
          in_byte++;
          sw->u.hash.rlen++;
          len--;
        }

      /* If hash_rlen still not sizeof(uint32_t) then input buffer
       * doesn't hold enough bytes to write into DIN.
       */

      if (sw->u.hash.rlen < sizeof(uint32_t))
        {
          return 0;
        }

      stm32crypto_putreg32(sw->u.hash.rdata, STM32_HASH_DIN);
      sw->u.hash.rlen = 0;
      sw->u.hash.rdata = 0x0;
    }

  in_block = (uint32_t *)in_byte;

  /* Loop pushing uint32_t of hash data into HASH_DIN */

  while (len >= sizeof(uint32_t))
    {
      ret = stm32_wait_for_clr(STM32_HASH_SR, HASH_SR_BUSY,
                             STM32H7_HASH_TIMEOUT);
      if (ret < 0)
        {
          return ret;
        }

      stm32crypto_putreg32(*in_block, STM32_HASH_DIN);
      in_block++;
      len -= sizeof(uint32_t);
    }

  /* Accumulate any remaining bytes into hash.rdata */

  if (len)
    {
      stm32cryptoinfo("len %" PRIu32 " hash.rlen: %" PRIu32 "",
                      len, sw->u.hash.rlen);
      in_byte = (uint8_t *)in_block;
      while (len)
        {
          sw->u.hash.rdata |= (in_byte[0] << (8 * sw->u.hash.rlen));
          sw->u.hash.rlen++;
          in_byte++;
          len--;
        }
    }

  return 0;
}

static int hash_final(struct stm32_crypto_data *sw, caddr_t digest,
                      uint32_t wait_flag)
{
  uint32_t *out = (uint32_t *)digest;
  uint32_t regval;
  int ret;

  stm32cryptoinfo("digest %" PRIxPTR "", (uintptr_t)digest);

  /* If any data left in rdata, write it out */

  if (sw->u.hash.rlen)
    {
      stm32crypto_putreg32(sw->u.hash.rdata, STM32_HASH_DIN);
    }

  /* Start digest calculation. Set NBLW to number of
   * bits of valid data in last write to HASH_DIN, and
   * set DCAL to start the digest calculation.
   */

  regval = HASH_STR_NBLW_BYTES((uint32_t)sw->u.hash.rlen);
  stm32crypto_putreg32(regval, STM32_HASH_STR);

  /* Set DCAL _after_ setting NBLW; have seen incorrect HMAC hash
   * result if both done at same time.
   */

  regval |= HASH_STR_DCAL;
  stm32crypto_putreg32(regval, STM32_HASH_STR);

  sw->u.hash.rlen = 0;
  sw->u.hash.rdata = 0x0;

  /* Wait for the digest to compute
   * (for HMAC wait for data to be ready)
   */

  ret = stm32_wait_for_set(STM32_HASH_SR, wait_flag,
                           STM32H7_HASH_TIMEOUT);
  if (ret < 0)
    {
      return ret;
    }

  /* Extract the resultant hash (if desired) */

  if (digest)
    {
      regval = stm32crypto_getreg32(STM32_HASH_HRA0);
      *out++ = __builtin_bswap32(regval);
      regval = stm32crypto_getreg32(STM32_HASH_HRA1);
      *out++ = __builtin_bswap32(regval);
      regval = stm32crypto_getreg32(STM32_HASH_HRA2);
      *out++ = __builtin_bswap32(regval);
      regval = stm32crypto_getreg32(STM32_HASH_HRA3);
      *out++ = __builtin_bswap32(regval);

      if (sw->u.hash.dsize >= 20)
        {
          regval = stm32crypto_getreg32(STM32_HASH_HRA4);
          *out++ = __builtin_bswap32(regval);
        }

      if (sw->u.hash.dsize >= 28)
        {
          regval = stm32crypto_getreg32(STM32_HASH_HR5);
          *out++ = __builtin_bswap32(regval);
          regval = stm32crypto_getreg32(STM32_HASH_HR6);
          *out++ = __builtin_bswap32(regval);
        }

      if (sw->u.hash.dsize == 32)
        {
          regval = stm32crypto_getreg32(STM32_HASH_HR7);
          *out++ = __builtin_bswap32(regval);
        }
    }

