apache/nuttx/arch/arm/src/stm32h7/stm32_crypto.c
  return 0;
}

/****************************************************************************
 * Name: stm32_freesession
 *
 * Description:
 *   free session.
 *
 ****************************************************************************/

static int stm32_freesession(uint64_t tid)
{
  FAR struct stm32_crypto_data *sw;
  uint32_t sid = ((uint32_t) tid) & 0xffffffff;
  int ret = 0;

  if (sid > g_stm32_sesnum || stm32_crypto_sessions == NULL
      || stm32_crypto_sessions[sid] == NULL)
    {
      return -EINVAL;
    }

  /* Silently accept and return */

  if (sid == 0)
    {
      return 0;
    }

  while ((sw = stm32_crypto_sessions[sid]) != NULL)
    {
      stm32_crypto_sessions[sid] = sw->hw_next;

      switch (sw->hw_alg)
        {
          case CRYPTO_SHA1_HMAC:
          case CRYPTO_MD5_HMAC:
          case CRYPTO_SHA2_224_HMAC:
          case CRYPTO_SHA2_256_HMAC:
            if (sw->u.hash.key)
            {
              explicit_bzero(sw->u.hash.key, sw->u.hash.klen);
              kmm_free(sw->u.hash.key);
            }
            break;

          case CRYPTO_CRC32:
          case CRYPTO_SHA1:
          case CRYPTO_MD5:
          case CRYPTO_SHA2_224:
          case CRYPTO_SHA2_256:
          case CRYPTO_AES_CBC:
          case CRYPTO_AES_CTR:
            break;

          default:
            ret = -EINVAL;
            break;
        }

      kmm_free(sw);
    }

  return ret;
}

/****************************************************************************
 * Name: stm32_newsession
 *
 * Description:
 *   create new session for crypto.
 *
 ****************************************************************************/

static int stm32_newsession(uint32_t *sid, struct cryptoini *cri)
{
  FAR struct stm32_crypto_data **swd;
  FAR struct stm32_crypto_data *sw;
  uint32_t i;
  int klen;
  int ret;

  stm32cryptoinfo("");

  if (sid == NULL || cri == NULL)
    {
      return -EINVAL;
    }

  if (stm32_crypto_sessions)
    {
      for (i = 1; i < g_stm32_sesnum; i++)
        {
          if (stm32_crypto_sessions[i] == NULL)
            {
              break;
            }
        }
    }

  if (stm32_crypto_sessions == NULL || i == g_stm32_sesnum)
    {
      if (stm32_crypto_sessions == NULL)
        {
          i = 1; /* We leave stm32_crypto_sessions[0] empty */
          g_stm32_sesnum = CRYPTO_SW_SESSIONS;
        }
      else
        {
          g_stm32_sesnum *= 2;
        }

      swd = kmm_calloc(g_stm32_sesnum, sizeof(struct stm32_crypto_data *));
      if (swd == NULL)
        {
          /* Reset session number */

          if (g_stm32_sesnum == CRYPTO_SW_SESSIONS)
            {
              g_stm32_sesnum = 0;
            }
          else
            {
              g_stm32_sesnum /= 2;
            }

          return -ENOBUFS;
        }

      /* Copy existing sessions */

      if (stm32_crypto_sessions)
        {
          bcopy(stm32_crypto_sessions, swd,
              (g_stm32_sesnum / 2) * sizeof(struct stm32_crypto_data *));
          kmm_free(stm32_crypto_sessions);
        }

      stm32_crypto_sessions = swd;
    }

  swd = &stm32_crypto_sessions[i];
  *sid = i;

  while (cri)
    {
      sw = kmm_zalloc(sizeof(struct stm32_crypto_data));
      *swd = sw;
      if (sw == NULL)
        {
          stm32_freesession(i);
          return -ENOBUFS;
        }

      sw->hw_alg = cri->cri_alg;
      switch (cri->cri_alg)
        {
          case CRYPTO_MD5_HMAC:
          case CRYPTO_SHA1_HMAC:
          case CRYPTO_SHA2_224_HMAC:
          case CRYPTO_SHA2_256_HMAC:
            sw->u.hash.hmac = true;
            sw->u.hash.klen = cri->cri_klen / 8;
            sw->u.hash.key = kmm_malloc(sw->u.hash.klen);
            if (sw->u.hash.key == NULL)
            {
              return -ENOBUFS;
            }

            bcopy(cri->cri_key, sw->u.hash.key, sw->u.hash.klen);

            /* Initialize HW, push the key into DIN, wait for DINIS */

            ret = hash_init(sw);
            if (ret < 0)
              {
                return ret;
              }

            stm32cryptoinfo("Push %" PRIu32 " bytes of outer hash into DIN",
                           sw->u.hash.klen);
            ret = hash_update(sw, sw->u.hash.key, sw->u.hash.klen);
            if (ret < 0)
              {
                return ret;
              }

            stm32cryptoinfo("Wait for DINIS");
            ret = hash_final(sw, NULL, HASH_SR_DINIS);
            if (ret < 0)
              {
                return ret;
              }

            break;

          case CRYPTO_MD5:
          case CRYPTO_SHA1:
          case CRYPTO_SHA2_224:
          case CRYPTO_SHA2_256:
            sw->u.hash.hmac = false;
            ret = hash_init(sw);
            if (ret < 0)
            {
              return ret;
            }
            break;

          case CRYPTO_CRC32:
            crc32_init(sw);
            break;

          case CRYPTO_AES_CBC:
            break;

          case CRYPTO_AES_CTR:
            klen = cri->cri_klen / 8 - 4;
            if ((klen != 16) && (klen != 24) && (klen != 32))
            {
              /* stm32h7 aes-ctr key bits support 128, 192, or 256 */

              return -EINVAL;
            }

            break;

          default:
            stm32_freesession(i);
            return -EINVAL;
        }

      sw->hw_alg = cri->cri_alg;
      cri = cri->cri_next;
      swd = &(sw->hw_next);
    }

  return 0;
}

/****************************************************************************
 * Name: stm32_process
 *
 * Description:
 *   process session to use hardware algorithm.
 *
 ****************************************************************************/

static int stm32_process(struct cryptop *crp)
{
  FAR struct stm32_crypto_data *sw;
  struct cryptodesc *crd;
  uint8_t iv[AESCTR_BLOCKSIZE];
  uint32_t lid;
  int ret;

  stm32cryptoinfo("");

  /* Sanity check */

  if (crp == NULL)
    {
      stm32cryptoinfo("");
      return -EINVAL;
    }

  if (crp->crp_desc == NULL)
    {
      stm32cryptoinfo("");
      crp->crp_etype = -EINVAL;
      goto done;
    }

  lid = crp->crp_sid & 0xffffffff;
  if (lid >= g_stm32_sesnum || lid == 0
      || stm32_crypto_sessions[lid] == NULL)
    {
      stm32cryptoinfo("");
      crp->crp_etype = -ENOENT;
      goto done;
    }

  /* Go through crypto descriptors, processing as we go */

  for (crd = crp->crp_desc; crd; crd = crd->crd_next)
    {
      /* Find the crypto context.
       * XXX Note that the logic here prevents us from having
       * XXX the same algorithm multiple times in a session
       * XXX (or rather, we can but it won't give us the right
       * XXX results). To do that, we'd need some way of differentiating
       * XXX between the various instances of an algorithm (so we can
       * XXX locate the correct crypto context).
       */

      for (sw = stm32_crypto_sessions[lid];
           sw && sw->hw_alg != crd->crd_alg;
           sw = sw->hw_next);

      /* No such context ? */

      if (sw == NULL)
        {
          stm32cryptoinfo("");
          return -EINVAL;
        }

