apache/nuttx/arch/arm/src/stm32h7/stm32_crypto.c
      switch (crd->crd_alg)
        {
          case CRYPTO_MD5:
          case CRYPTO_SHA1:
          case CRYPTO_SHA2_224:
          case CRYPTO_SHA2_256:
            if (crd->crd_flags & CRD_F_UPDATE)
              {
                return hash_update(sw, crp->crp_buf, crd->crd_len);
              }
            else
              {
                return hash_final(sw, crp->crp_mac, HASH_SR_DCIS);
              }
            break;
          case CRYPTO_MD5_HMAC:
          case CRYPTO_SHA1_HMAC:
          case CRYPTO_SHA2_224_HMAC:
          case CRYPTO_SHA2_256_HMAC:
            ret = hash_update(sw, crp->crp_buf, crd->crd_len);
            if (ret < 0 || (crd->crd_flags & CRD_F_UPDATE))
              {
                return ret;
              }

            /* All HMAC data has been hashed, next step is
             * 1) set DCAL and HBLW, wait for DINIS
             */

            ret = hash_final(sw, NULL, HASH_SR_DINIS);
            if (ret < 0)
              {
                stm32cryptoinfo("");
                return ret;
              }

            /* 2) Push outer hash (same as inner hash) into DIN */

            stm32cryptoinfo("Push %" PRIu32 " bytes of inner hash",
                            sw->u.hash.klen);

            ret = hash_update(sw, sw->u.hash.key, sw->u.hash.klen);
            if (ret < 0)
              {
                stm32cryptoinfo("");
                return ret;
              }

            /* 3) normal finalization */

            return hash_final(sw, crp->crp_mac, HASH_SR_DCIS);

            break;

          case CRYPTO_CRC32:
            if (crd->crd_flags & CRD_F_UPDATE)
            {
              return crc32_update(sw, crp->crp_buf, crd->crd_len);
            }
            else
            {
              return crc32_final(sw, crp->crp_mac);
            }
            break;
          case CRYPTO_AES_CBC:
            return aes_cypher(crp->crp_dst, crp->crp_buf, crd->crd_len,
                              crp->crp_iv, crd->crd_key, 16,
                              AES_MODE_CBC, crd->crd_flags & CRD_F_ENCRYPT);
          case CRYPTO_AES_CTR:

            memcpy(iv, crd->crd_key + crd->crd_klen / 8 - AESCTR_NONCESIZE,
                   AESCTR_NONCESIZE);
            memcpy(iv + AESCTR_NONCESIZE, crp->crp_iv, AESCTR_IVSIZE);
            memcpy(iv + AESCTR_NONCESIZE + AESCTR_IVSIZE,
                   (uint8_t *)crp->crp_iv + AESCTR_IVSIZE, 4);

            return aes_cypher(crp->crp_dst, crp->crp_buf,
                              crd->crd_len, iv, crd->crd_key,
                              crd->crd_klen / 8 - AESCTR_NONCESIZE,
                              AES_MODE_CTR, crd->crd_flags & CRD_F_ENCRYPT);
          default:
            stm32cryptoinfo("crc_alg %d", crd->crd_alg);
            return -EINVAL;
        }
    }

  done:
  return OK;
}

/****************************************************************************
 * Name: hwcr_init
 *
 * Description:
 *   register the hardware crypto driver.
 *
 ****************************************************************************/

void hwcr_init(void)
{
  int hwcr_id;
  int algs[CRYPTO_ALGORITHM_MAX + 1];

  hwcr_id = crypto_get_driverid(0);
  DEBUGASSERT(hwcr_id >= 0);

  memset(algs, 0, sizeof(algs));

  algs[CRYPTO_CRC32] = CRYPTO_ALG_FLAG_SUPPORTED;
  algs[CRYPTO_MD5] = CRYPTO_ALG_FLAG_SUPPORTED;
  algs[CRYPTO_SHA1] = CRYPTO_ALG_FLAG_SUPPORTED;
  algs[CRYPTO_SHA2_224] = CRYPTO_ALG_FLAG_SUPPORTED;
  algs[CRYPTO_SHA2_256] = CRYPTO_ALG_FLAG_SUPPORTED;

  algs[CRYPTO_MD5_HMAC] = CRYPTO_ALG_FLAG_SUPPORTED;
  algs[CRYPTO_SHA1_HMAC] = CRYPTO_ALG_FLAG_SUPPORTED;
  algs[CRYPTO_SHA2_224_HMAC] = CRYPTO_ALG_FLAG_SUPPORTED;
  algs[CRYPTO_SHA2_256_HMAC] = CRYPTO_ALG_FLAG_SUPPORTED;

  algs[CRYPTO_AES_CBC] = CRYPTO_ALG_FLAG_SUPPORTED;
  algs[CRYPTO_AES_CTR] = CRYPTO_ALG_FLAG_SUPPORTED;

  crypto_register(hwcr_id, algs, stm32_newsession,
                  stm32_freesession, stm32_process);
}
